IDENTIFICATION DIVISION.
PROGRAM-ID. CONDITIONS.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-AGE PIC 9(3).

PROCEDURE DIVISION.
    MOVE 20 TO WS-AGE.

    IF WS-AGE < 18
        DISPLAY "Mineur"
    ELSE
        DISPLAY "Majeur"
    END-IF.

    STOP RUN.