>>SOURCE FORMAT FREE

IDENTIFICATION DIVISION.
PROGRAM-ID. BANQUEFILE.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT F-OPERATIONS ASSIGN TO "operations.txt"
        ORGANIZATION IS LINE SEQUENTIAL.



DATA DIVISION.
FILE SECTION.

FD F-OPERATIONS.
01 F-OP-REC PIC X(10).

WORKING-STORAGE SECTION.
01 WS-EOF PIC X VALUE "N".

01 WS-SOLDE-O PIC S9(4)V9(2).
01 WS-SOLDE-C PIC S9(4)V9(2).
01 WS-SOLDE-TMP PIC S9(4)V9(2).

01 WS-OPERATIONS.
    05 WS-OP PIC S9(4)V9(2) OCCURS 10 TIMES.

01 WS-OP-NB PIC 9(3).

01 WS-OP-C PIC S9(4)V9(2).

01 WS-I PIC 9(3).

PROCEDURE DIVISION.

    MOVE 0 TO WS-OP-NB.

    MOVE 1000.00 TO WS-SOLDE-O.
    MOVE WS-SOLDE-O TO WS-SOLDE-C.

    PERFORM SETOP
    

    DISPLAY "Solde initial : " WS-SOLDE-O.
    DISPLAY "Nbr transaction : " WS-OP-NB.

    PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > WS-OP-NB
        IF WS-OP(WS-I) NOT = 0
            MOVE WS-OP(WS-I) TO WS-OP-C
            PERFORM CALCUL
        END-IF
    END-PERFORM.

    DISPLAY "Solde final : " WS-SOLDE-C.

    STOP RUN.

CALCUL.
    
    COMPUTE WS-SOLDE-TMP = WS-SOLDE-C + WS-OP-C.
    IF WS-SOLDE-TMP >= 0
        ADD WS-OP-C TO WS-SOLDE-C
        IF WS-OP-C >= 0
            DISPLAY "Operation : CREDIT Montant : " WS-OP-C
        ELSE
            DISPLAY "Operation : DEBIT Montant : " WS-OP-C
        END-IF
    ELSE
        DISPLAY "ERREUR : solde insuffisant"
    END-IF.
    DISPLAY "Solde apres operation : " WS-SOLDE-C.
EXIT.

SETOP.
    OPEN INPUT F-OPERATIONS.
    MOVE "N" TO WS-EOF
    PERFORM UNTIL WS-EOF = "Y" OR WS-OP-NB >= 10
        READ F-OPERATIONS   
            AT END MOVE "Y" TO WS-EOF
            NOT AT END 
                ADD 1 TO WS-OP-NB
                MOVE F-OP-REC TO WS-OP(WS-OP-NB)
        END-READ
    END-PERFORM.
    CLOSE F-OPERATIONS.
