IDENTIFICATION DIVISION.
PROGRAM-ID. BOUCLE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-I PIC 9(2).

PROCEDURE DIVISION.
    PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > 5
        DISPLAY "Compteur : " WS-I
    END-PERFORM.

    STOP RUN.