IDENTIFICATION DIVISION.
PROGRAM-ID. FACTURATION.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT F-FACTURE ASSIGN TO "commandes.txt"
        ORGANIZATION IS LINE SEQUENTIAL.
    SELECT F-REJETS ASSIGN TO "rejets.txt"
        ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.

FD F-FACTURE.
01 F-FAC-REC PIC X(30).

FD F-REJETS.
01 F-REJ-REC PIC X(50).

WORKING-STORAGE SECTION.
01 WS-EOF PIC X VALUE "N".

01 WS-FAC-C PIC X(30).

01 WS-FACTURE.
    05 WS-NUM PIC 9(8) OCCURS 20 TIMES.
    05 WS-CDC PIC X(5) OCCURS 20 TIMES.
    05 WS-TYP PIC X(1) OCCURS 20 TIMES.
    05 WS-CDP PIC X(5) OCCURS 20 TIMES.
    05 WS-QTE PIC 9(3) OCCURS 20 TIMES.
    05 WS-PRI PIC 9(5)V9(2) OCCURS 20 TIMES.

01 WS-FAC-NB PIC 9(3).
01 WS-FAC-OK PIC 9(3).
01 WS-FAC-REJ PIC 9(3).

01 WS-I PIC 9(3).
01 WS-QTE-TMP PIC 9(3).

PROCEDURE DIVISION.

    MOVE "X" TO WS-EOF.
    OPEN INPUT F-FACTURE.
    PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-EOF = "Y"
        READ F-FACTURE   
            AT END MOVE "Y" TO WS-EOF
            NOT AT END 
                ADD 1 TO WS-FAC-NB
                MOVE F-FAC-REC TO WS-FAC-C
        END-READ
        MOVE WS-FAC-C(21:3) TO WS-QTE-TMP
        IF WS-QTE-TMP NOT = 0
            ADD 1 TO WS-FAC-OK
            MOVE WS-FAC-C(1:8) TO WS-NUM(WS-I)
            MOVE WS-FAC-C(9:5) TO WS-CDC(WS-I)
            MOVE WS-FAC-C(15:1) TO WS-TYP(WS-I)
            MOVE WS-FAC-C(16:5) TO WS-CDP(WS-I)
            MOVE WS-FAC-C(21:3) TO WS-QTE(WS-I)
            MOVE WS-FAC-C(24:7) TO WS-PRI(WS-I)
            DIVIDE WS-PRI(WS-I) BY 100 GIVING WS-PRI(WS-I)

            EVALUATE WS-TYP(WS-I)
                WHEN "E"
                    COMPUTE WS-PRI(WS-I) = WS-PRI(WS-I) * 0.9
                WHEN "P"
                    CONTINUE
                WHEN OTHER
                    DISPLAY "error with number " WS-NUM(WS-I) " not valid client type"
            END-EVALUATE
            DISPLAY WS-NUM(WS-I)
            DISPLAY WS-CDC(WS-I)
            DISPLAY WS-TYP(WS-I)
            DISPLAY WS-CDP(WS-I)
            DISPLAY WS-QTE(WS-I)
            DISPLAY WS-PRI(WS-I)
            DISPLAY "------------------------------------"
        ELSE
            ADD 1 TO WS-FAC-REJ
        END-IF
        
    END-PERFORM.
    DISPLAY WS-FAC-NB.
    DISPLAY WS-FAC-OK.
    DISPLAY WS-FAC-REJ.
    CLOSE F-FACTURE.

    STOP RUN.