IDENTIFICATION DIVISION.
PROGRAM-ID. FACTURATION.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT F-FACTURE ASSIGN TO "commandes.txt"
        ORGANIZATION IS LINE SEQUENTIAL.
    SELECT F-REJETS ASSIGN TO "rejets.txt"
        ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.

FD F-FACTURE.
01 F-FAC-REC PIC X(30).

FD F-REJETS.
01 F-REJ-REC PIC X(50).

WORKING-STORAGE SECTION.
01 WS-EOF PIC X VALUE "N".

01 WS-FAC-C PIC X(30).

01 WS-NUM-C PIC 9(8).
01 WS-CDC-C PIC X(5).
01 WS-TYP-C PIC X(1).
01 WS-CDP-C PIC X(5).
01 WS-QTE-C PIC 9(3).
01 WS-PRI-C PIC 9(5)V9(2).

01 WS-FAC-NB PIC 9(3).
01 WS-FAC-OK PIC 9(3).
01 WS-FAC-REJ PIC 9(3).

PROCEDURE DIVISION.

    MOVE "X" TO WS-EOF.
    OPEN INPUT F-FACTURE.
    PERFORM UNTIL WS-EOF = "Y"
        READ F-FACTURE   
            AT END MOVE "Y" TO WS-EOF
            NOT AT END 
                ADD 1 TO WS-FAC-NB
                MOVE F-FAC-REC TO WS-FAC-C
        END-READ
        MOVE WS-FAC-C(1:8) TO WS-NUM-C
        MOVE WS-FAC-C(9:5) TO WS-CDC-C
        MOVE WS-FAC-C(15:1) TO WS-TYP-C
        MOVE WS-FAC-C(16:5) TO WS-CDP-C
        MOVE WS-FAC-C(21:3) TO WS-QTE-C
        MOVE WS-FAC-C(24:7) TO WS-PRI-C
        DIVIDE WS-PRI-C BY 100 GIVING WS-PRI-C
 
        DISPLAY WS-NUM-C
        DISPLAY WS-CDC-C
        DISPLAY WS-TYP-C
        DISPLAY WS-CDP-C
        DISPLAY WS-QTE-C
        DISPLAY WS-PRI-C
    END-PERFORM.
    CLOSE F-FACTURE.

    STOP RUN.