IDENTIFICATION DIVISION.
PROGRAM-ID. PANGRAM.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 WS-SENTENCE PIC X(60).
01 WS-RESULT PIC 9.
01 WS-ALPHABET PIC X(26) VALUE "abcdefghijklmnopqrstuvwxyz".
01 WS-I PIC 9(2).
01 WS-COMPTEUR PIC 9(2).

PROCEDURE DIVISION.

PANGRAM.
MOVE 1 TO WS-COMPTEUR.
MOVE "the quick brown fox jumps over the lazy dog" TO WS-SENTENCE.
MOVE FUNCTION LOWER-CASE(WS-SENTENCE) TO WS-SENTENCE.
PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I >= 27 OR WS-COMPTEUR = 0
    MOVE 0 TO WS-COMPTEUR
    INSPECT WS-SENTENCE
        TALLYING WS-COMPTEUR
        FOR ALL WS-ALPHABET(WS-I:1)
    DISPLAY WS-ALPHABET(WS-I:1) " : " WS-COMPTEUR
END-PERFORM
IF WS-COMPTEUR >=1
    DISPLAY "CECI EST UN PANGRAM"
    MOVE 1 TO WS-RESULT
ELSE
    DISPLAY "CECI N EST PAS UN PANGRAM"
    MOVE 0 TO WS-RESULT
END-IF