IDENTIFICATION DIVISION.
PROGRAM-ID. OPERATIONS.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-A PIC 9(3).
01 WS-B PIC 9(3).
01 WS-RES PIC 9(3).

PROCEDURE DIVISION.
    MOVE 10 TO WS-A.
    MOVE 5 TO WS-B.

    ADD WS-A TO WS-B GIVING WS-RES.
    DISPLAY "Addition : " WS-RES.

    SUBTRACT WS-A FROM WS-B GIVING WS-RES.
    DISPLAY "Soustraction : " WS-RES.

    MULTIPLY WS-A BY WS-B GIVING WS-RES.
    DISPLAY "Multiplication : " WS-RES.

    DIVIDE WS-A BY WS-B GIVING WS-RES.
    DISPLAY "Division : " WS-RES.

    STOP RUN.