IDENTIFICATION DIVISION.
PROGRAM-ID. VARIABLES.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NOM PIC X(20).
01 WS-AGE PIC 9(3).

PROCEDURE DIVISION.
    MOVE "Mouss" TO WS-NOM.
    MOVE 25 TO WS-AGE.

    DISPLAY "Nom : " WS-NOM.
    DISPLAY "Age : " WS-AGE.

    STOP RUN.